[Killed] UnaryOperator
src/gilded_rose.mjs:3:35
 export class Item {
   SPECIAL_PRODUCTS = [
-    { name: "Aged Brie", quality: -1, sellIn: 1 },
+    { name: "Aged Brie", quality: +1, sellIn: 1 },
     { name: "Backstage passes to a TAFKAL80ETC concert", quality: -1, sellIn: 1 },
     { name: "Sulfuras, Hand of Ragnaros", quality: 0, sellIn: 0 },
killedBy: Gilded Rose aged brie increases in quality
statusReason: expected 9 to equal 11

[Killed] StringLiteral
src/gilded_rose.mjs:3:13
 export class Item {
   SPECIAL_PRODUCTS = [
-    { name: "Aged Brie", quality: -1, sellIn: 1 },
+    { name: "", quality: -1, sellIn: 1 },
     { name: "Backstage passes to a TAFKAL80ETC concert", quality: -1, sellIn: 1 },
     { name: "Sulfuras, Hand of Ragnaros", quality: 0, sellIn: 0 },
killedBy: Gilded Rose aged brie increases in quality
statusReason: expected 9 to equal 11

[Killed] UnaryOperator
src/gilded_rose.mjs:4:67
 export class Item {
   SPECIAL_PRODUCTS = [
     { name: "Aged Brie", quality: -1, sellIn: 1 },
-    { name: "Backstage passes to a TAFKAL80ETC concert", quality: -1, sellIn: 1 },
+    { name: "Backstage passes to a TAFKAL80ETC concert", quality: +1, sellIn: 1 },
     { name: "Sulfuras, Hand of Ragnaros", quality: 0, sellIn: 0 },
   ];
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: expected 9 to equal 11

[Killed] ObjectLiteral
src/gilded_rose.mjs:4:5
 export class Item {
   SPECIAL_PRODUCTS = [
     { name: "Aged Brie", quality: -1, sellIn: 1 },
-    { name: "Backstage passes to a TAFKAL80ETC concert", quality: -1, sellIn: 1 },
+    {},
     { name: "Sulfuras, Hand of Ragnaros", quality: 0, sellIn: 0 },
   ];
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: expected 9 to equal 11

[Killed] StringLiteral
src/gilded_rose.mjs:5:13
   SPECIAL_PRODUCTS = [
     { name: "Aged Brie", quality: -1, sellIn: 1 },
     { name: "Backstage passes to a TAFKAL80ETC concert", quality: -1, sellIn: 1 },
-    { name: "Sulfuras, Hand of Ragnaros", quality: 0, sellIn: 0 },
+    { name: "", quality: 0, sellIn: 0 },
   ];
 
killedBy: Gilded Rose Sulfuras sellIn doesn't decrease
statusReason: expected 4 to equal 5

[Killed] BlockStatement
src/gilded_rose.mjs:8:38
     { name: "Sulfuras, Hand of Ragnaros", quality: 0, sellIn: 0 },
   ];
 
-  constructor(name, sellIn, quality) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = quality;
-    this.adjustments = this.determineAdjustments(name);
-  }
+  constructor(name, sellIn, quality) {}
 
   determineAdjustments(name) {
killedBy: Gilded Rose returns an array
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] BlockStatement
src/gilded_rose.mjs:15:30
     this.adjustments = this.determineAdjustments(name);
   }
 
-  determineAdjustments(name) {
-    if (!this.isNormalProduct()) {
-      const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
-      return { quality: product.quality, sellIn: product.sellIn }
-    } else {
-      return { quality: 1, sellIn: 1 };
-    }
-  }
+  determineAdjustments(name) {}
 
   checkAdjustments() {
killedBy: Gilded Rose returns an array
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] ConditionalExpression
src/gilded_rose.mjs:16:9
   }
 
   determineAdjustments(name) {
-    if (!this.isNormalProduct()) {
+    if (false) {
       const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
       return { quality: product.quality, sellIn: product.sellIn }
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: expected 9 to equal 11

[Killed] BlockStatement
src/gilded_rose.mjs:16:34
   }
 
   determineAdjustments(name) {
-    if (!this.isNormalProduct()) {
-      const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
-      return { quality: product.quality, sellIn: product.sellIn }
-    } else {
+    if (!this.isNormalProduct()) {} else {
       return { quality: 1, sellIn: 1 };
     }
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] EqualityOperator
src/gilded_rose.mjs:17:65
 
   determineAdjustments(name) {
     if (!this.isNormalProduct()) {
-      const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
+      const product = this.SPECIAL_PRODUCTS.filter((product) => product.name !== name)[0]
       return { quality: product.quality, sellIn: product.sellIn }
     } else {
killedBy: Gilded Rose Sulfuras sellIn doesn't decrease
statusReason: expected 4 to equal 5

[Killed] ArrowFunction
src/gilded_rose.mjs:17:52
 
   determineAdjustments(name) {
     if (!this.isNormalProduct()) {
-      const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
+      const product = this.SPECIAL_PRODUCTS.filter(() => undefined)[0]
       return { quality: product.quality, sellIn: product.sellIn }
     } else {
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] ObjectLiteral
src/gilded_rose.mjs:18:14
   determineAdjustments(name) {
     if (!this.isNormalProduct()) {
       const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
-      return { quality: product.quality, sellIn: product.sellIn }
+      return {}
     } else {
       return { quality: 1, sellIn: 1 };
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: expected 10 to equal 11

[Killed] BlockStatement
src/gilded_rose.mjs:19:12
     if (!this.isNormalProduct()) {
       const product = this.SPECIAL_PRODUCTS.filter((product) => product.name === name)[0]
       return { quality: product.quality, sellIn: product.sellIn }
-    } else {
-      return { quality: 1, sellIn: 1 };
-    }
+    } else {}
   }
 
killedBy: Gilded Rose returns an array
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] BlockStatement
src/gilded_rose.mjs:24:22
     }
   }
 
-  checkAdjustments() {
-    if (this.sellInIsBelow(0)) {
-      const sign = Math.sign(this.adjustments.quality);
-      this.adjustments.quality = 2 * sign;
-    }
-
-    if (this.sellInIsBelow(11) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
-      this.adjustments.quality = -2;
-    }
-
-    if (this.sellInIsBelow(6) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
-      this.adjustments.quality = -3;
-    }
-
-    if (this.sellInIsBelow(0) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
-      this.adjustments.quality = 0;
-      this.emptyQuality();
-    }
-  }
+  checkAdjustments() {}
 
   adjustSellIn() {
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:25:9
   }
 
   checkAdjustments() {
-    if (this.sellInIsBelow(0)) {
+    if (false) {
       const sign = Math.sign(this.adjustments.quality);
       this.adjustments.quality = 2 * sign;
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:25:9
   }
 
   checkAdjustments() {
-    if (this.sellInIsBelow(0)) {
+    if (true) {
       const sign = Math.sign(this.adjustments.quality);
       this.adjustments.quality = 2 * sign;
killedBy: Gilded Rose quality decreases by 1
statusReason: expected +0 to equal 1

[Timeout] ArithmeticOperator
src/gilded_rose.mjs:27:34
   checkAdjustments() {
     if (this.sellInIsBelow(0)) {
       const sign = Math.sign(this.adjustments.quality);
-      this.adjustments.quality = 2 * sign;
+      this.adjustments.quality = 2 / sign;
     }
 

[Killed] LogicalOperator
src/gilded_rose.mjs:30:9
       this.adjustments.quality = 2 * sign;
     }
 
-    if (this.sellInIsBelow(11) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
+    if (this.sellInIsBelow(11) || this.name == "Backstage passes to a TAFKAL80ETC concert") {
       this.adjustments.quality = -2;
     }
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 4 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:30:35
       this.adjustments.quality = 2 * sign;
     }
 
-    if (this.sellInIsBelow(11) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
+    if (this.sellInIsBelow(11) && true) {
       this.adjustments.quality = -2;
     }
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 4 to equal 1

[Killed] UnaryOperator
src/gilded_rose.mjs:31:34
     }
 
     if (this.sellInIsBelow(11) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
-      this.adjustments.quality = -2;
+      this.adjustments.quality = +2;
     }
 
killedBy: Gilded Rose backstage pass quality increases 2 with 10 or less days to sell
statusReason: expected 8 to equal 12

[Killed] EqualityOperator
src/gilded_rose.mjs:34:34
       this.adjustments.quality = -2;
     }
 
-    if (this.sellInIsBelow(6) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
+    if (this.sellInIsBelow(6) && this.name != "Backstage passes to a TAFKAL80ETC concert") {
       this.adjustments.quality = -3;
     }
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 5 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:34:92
       this.adjustments.quality = -2;
     }
 
-    if (this.sellInIsBelow(6) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
-      this.adjustments.quality = -3;
-    }
+    if (this.sellInIsBelow(6) && this.name == "Backstage passes to a TAFKAL80ETC concert") {}
 
     if (this.sellInIsBelow(0) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
killedBy: Gilded Rose backstage pass quality increases 3 with 5 or less days to sell
statusReason: expected 12 to equal 13

[Killed] UnaryOperator
src/gilded_rose.mjs:35:34
     }
 
     if (this.sellInIsBelow(6) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
-      this.adjustments.quality = -3;
+      this.adjustments.quality = +3;
     }
 
killedBy: Gilded Rose backstage pass quality increases 3 with 5 or less days to sell
statusReason: expected 7 to equal 13

[Killed] LogicalOperator
src/gilded_rose.mjs:38:9
       this.adjustments.quality = -3;
     }
 
-    if (this.sellInIsBelow(0) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
+    if (this.sellInIsBelow(0) || this.name == "Backstage passes to a TAFKAL80ETC concert") {
       this.adjustments.quality = 0;
       this.emptyQuality();
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected +0 to equal 8

[Killed] EqualityOperator
src/gilded_rose.mjs:38:34
       this.adjustments.quality = -3;
     }
 
-    if (this.sellInIsBelow(0) && this.name == "Backstage passes to a TAFKAL80ETC concert") {
+    if (this.sellInIsBelow(0) && this.name != "Backstage passes to a TAFKAL80ETC concert") {
       this.adjustments.quality = 0;
       this.emptyQuality();
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected +0 to equal 8

[Killed] BlockStatement
src/gilded_rose.mjs:44:18
     }
   }
 
-  adjustSellIn() {
-    this.sellIn = this.sellIn - this.adjustments.sellIn;
-  }
+  adjustSellIn() {}
 
   sellInIsBelow(days) {
killedBy: Gilded Rose sellIn decreases by 1
statusReason: expected 1 to equal +0

[Killed] ArithmeticOperator
src/gilded_rose.mjs:45:19
   }
 
   adjustSellIn() {
-    this.sellIn = this.sellIn - this.adjustments.sellIn;
+    this.sellIn = this.sellIn + this.adjustments.sellIn;
   }
 
killedBy: Gilded Rose sellIn decreases by 1
statusReason: expected 2 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:48:23
     this.sellIn = this.sellIn - this.adjustments.sellIn;
   }
 
-  sellInIsBelow(days) {
-    return this.sellIn < days;
-  }
+  sellInIsBelow(days) {}
 
   adjustQuality() {
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:49:12
   }
 
   sellInIsBelow(days) {
-    return this.sellIn < days;
+    return false;
   }
 
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected 9 to equal 8

[Killed] EqualityOperator
src/gilded_rose.mjs:49:12
   }
 
   sellInIsBelow(days) {
-    return this.sellIn < days;
+    return this.sellIn <= days;
   }
 
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: expected 12 to equal 11

[Killed] BlockStatement
src/gilded_rose.mjs:52:19
     return this.sellIn < days;
   }
 
-  adjustQuality() {
-    let timesToAdjust = Math.abs(this.adjustments.quality);
-    const adjustment = this.adjustments.quality / timesToAdjust;
-    if (this.name.includes("Conjured")) {
-      timesToAdjust = timesToAdjust * 2;
-    }
-    for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
-      if (this.validQuality(adjustment)) {
-        this.quality = this.quality - adjustment;
-      }
-    }
-  }
+  adjustQuality() {}
 
   emptyQuality() {
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 2 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:54:24
 
   adjustQuality() {
     let timesToAdjust = Math.abs(this.adjustments.quality);
-    const adjustment = this.adjustments.quality / timesToAdjust;
+    const adjustment = this.adjustments.quality * timesToAdjust;
     if (this.name.includes("Conjured")) {
       timesToAdjust = timesToAdjust * 2;
killedBy: Gilded Rose quality decreases by 2 past sellIn date
statusReason: expected 2 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:55:9
   adjustQuality() {
     let timesToAdjust = Math.abs(this.adjustments.quality);
     const adjustment = this.adjustments.quality / timesToAdjust;
-    if (this.name.includes("Conjured")) {
+    if (false) {
       timesToAdjust = timesToAdjust * 2;
     }
killedBy: Gilded Rose Conjured item quality decreases by 2
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:55:9
   adjustQuality() {
     let timesToAdjust = Math.abs(this.adjustments.quality);
     const adjustment = this.adjustments.quality / timesToAdjust;
-    if (this.name.includes("Conjured")) {
+    if (true) {
       timesToAdjust = timesToAdjust * 2;
     }
killedBy: Gilded Rose quality decreases by 1
statusReason: expected +0 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:56:23
     let timesToAdjust = Math.abs(this.adjustments.quality);
     const adjustment = this.adjustments.quality / timesToAdjust;
     if (this.name.includes("Conjured")) {
-      timesToAdjust = timesToAdjust * 2;
+      timesToAdjust = timesToAdjust / 2;
     }
     for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
killedBy: Gilded Rose Conjured item quality decreases by 2
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:58:28
     if (this.name.includes("Conjured")) {
       timesToAdjust = timesToAdjust * 2;
     }
-    for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
+    for (let adjusted = 0; false; adjusted++) {
       if (this.validQuality(adjustment)) {
         this.quality = this.quality - adjustment;
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 2 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:58:28
     if (this.name.includes("Conjured")) {
       timesToAdjust = timesToAdjust * 2;
     }
-    for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
+    for (let adjusted = 0; adjusted <= timesToAdjust; adjusted++) {
       if (this.validQuality(adjustment)) {
         this.quality = this.quality - adjustment;
killedBy: Gilded Rose quality decreases by 1
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:59:11
       timesToAdjust = timesToAdjust * 2;
     }
     for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
-      if (this.validQuality(adjustment)) {
+      if (true) {
         this.quality = this.quality - adjustment;
       }
killedBy: Gilded Rose quality doesn't decrease past 0 after sellIn date
statusReason: expected -2 to equal +0

[Killed] ConditionalExpression
src/gilded_rose.mjs:59:11
       timesToAdjust = timesToAdjust * 2;
     }
     for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
-      if (this.validQuality(adjustment)) {
+      if (false) {
         this.quality = this.quality - adjustment;
       }
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 2 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:60:24
     }
     for (let adjusted = 0; adjusted < timesToAdjust; adjusted++) {
       if (this.validQuality(adjustment)) {
-        this.quality = this.quality - adjustment;
+        this.quality = this.quality + adjustment;
       }
     }
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 3 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:65:18
     }
   }
 
-  emptyQuality() {
-    this.quality = 0;
-  }
+  emptyQuality() {}
 
   validQuality(adjustment) {
killedBy: Gilded Rose backstage pass loses value past sellIn date
statusReason: expected 10 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:69:28
     this.quality = 0;
   }
 
-  validQuality(adjustment) {
-    const adjustedQuality = this.quality - adjustment;
-    return adjustedQuality <= 50 && adjustedQuality >= 0;
-  }
+  validQuality(adjustment) {}
 
   isNormalProduct() {
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 2 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:70:29
   }
 
   validQuality(adjustment) {
-    const adjustedQuality = this.quality - adjustment;
+    const adjustedQuality = this.quality + adjustment;
     return adjustedQuality <= 50 && adjustedQuality >= 0;
   }
killedBy: Gilded Rose quality doesn't decrease past 0 after sellIn date
statusReason: expected -2 to equal +0

[Killed] EqualityOperator
src/gilded_rose.mjs:71:37
 
   validQuality(adjustment) {
     const adjustedQuality = this.quality - adjustment;
-    return adjustedQuality <= 50 && adjustedQuality >= 0;
+    return adjustedQuality <= 50 && adjustedQuality > 0;
   }
 
killedBy: Gilded Rose Conjured item quality doesn't decrease beyond 0
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/gilded_rose.mjs:71:12
 
   validQuality(adjustment) {
     const adjustedQuality = this.quality - adjustment;
-    return adjustedQuality <= 50 && adjustedQuality >= 0;
+    return false;
   }
 
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:74:21
     return adjustedQuality <= 50 && adjustedQuality >= 0;
   }
 
-  isNormalProduct() {
-    return !this.SPECIAL_PRODUCTS.map((product) => product.name).includes(this.name);
-  }
+  isNormalProduct() {}
 }
 
killedBy: Gilded Rose returns an array
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] ArrowFunction
src/gilded_rose.mjs:75:39
   }
 
   isNormalProduct() {
-    return !this.SPECIAL_PRODUCTS.map((product) => product.name).includes(this.name);
+    return !this.SPECIAL_PRODUCTS.map(() => undefined).includes(this.name);
   }
 }
killedBy: Gilded Rose backstage pass increases with sellIn date left
statusReason: expected 9 to equal 11

[Killed] BooleanLiteral
src/gilded_rose.mjs:75:12
   }
 
   isNormalProduct() {
-    return !this.SPECIAL_PRODUCTS.map((product) => product.name).includes(this.name);
+    return this.SPECIAL_PRODUCTS.map(product => product.name).includes(this.name);
   }
 }
killedBy: Gilded Rose returns an array
statusReason: Cannot read properties of undefined (reading 'quality')

[Killed] BlockStatement
src/gilded_rose.mjs:80:27
 }
 
 export class Shop {
-  constructor(items = []) {
-    this.items = items;
-  }
+  constructor(items = []) {}
 
   updateQuality() {
killedBy: Gilded Rose returns an array
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/gilded_rose.mjs:84:19
     this.items = items;
   }
 
-  updateQuality() {
-    this.items.forEach((item) => {
-      item.checkAdjustments();
-      item.adjustQuality();
-      item.adjustSellIn();
-    });
-
-    return this.items;
-  }
+  updateQuality() {}
 }
 
killedBy: Gilded Rose returns an array
statusReason: expected undefined to be an array

[Killed] BlockStatement
src/gilded_rose.mjs:85:34
   }
 
   updateQuality() {
-    this.items.forEach((item) => {
-      item.checkAdjustments();
-      item.adjustQuality();
-      item.adjustSellIn();
-    });
+    this.items.forEach((item) => {});
 
     return this.items;
killedBy: Gilded Rose quality decreases by 1
statusReason: expected 2 to equal 1
